[
  {
    "Title": "Esportowa kolekcja NFT. Wśród zaangażowanych m.in. NAVI i ENCE",
    "Content": "Choć NFT ma ogromną grupę zwolenników i równie duże grono przeciwników, to popularności zdobytej w 2021 tej technologii nie można odmówić. Nie może więc dziwić, że do trendu dołączają coraz to kolejne firmy. Tym razem na taki krok zdecydowało się ESL, które – we współpracy z firmą TheFabricant – stworzyło dedykowaną kolekcję wirtualnych przedmiotów związanych z ośmioma czołowymi organizacjami esportowymi. Do współpracy zaproszono osiem czołowych klubów esportowych, które są w mniejszym lub większym stopniu obecne na scenie Counter-Strike’a. Mamy tu bowiem do czynienia z Ninjas in Pyjamas, Natus Vincere, Astralis, Teamem Liquid, ENCE, Teamem Vitality, Fnatic i Evil Geniuses. Cała kolekcja składa się z szesnastu wirtualnych elementów. Każda z drużyn może pochwalić się NFT rękawiczek oraz pełnym outfitem, a poszczególne przedmioty różnią się wyłącznie kolorami.",
    "PublicationDate": "2021-09-12",
    "PhotoUrl": "https://cybersport.pl/wp-content/uploads/2021/12/team-gear-nft-esl-584-730x380.jpg",
    "UserId": 1
  },
  {
    "Title": "Acend miażdży Secret. zeek i starxo w półfinale VALORANT Champions!",
    "Content": "Chwilę temu zakończył się pierwszy mecz ćwierćfinałowy VALORANT Champions. Polscy fani produkcji Riot Games nie mogli lepiej sobie wyobrazić inauguracji play-offów tak ważnego turnieju, bowiem już na start zaprezentowało się Acend z dwoma rodakami w składzie. Rywalem zespołu Patryka „starxo” Kopczyńskiego i Aleksandra „zeeka” Zygmunta był Team Secret. Filipińska formacja jednak zderzyła się ze ścianą i została zmuszona błyskawicznie uznać wyższość europejskiej organizacji. Serię otworzył Icebox wybrany przez Team Secret. Już pierwsze rundy pokazały, jak emocjonujące będzie to spotkanie. Mimo ogromnego chaosu i zabójczego tempa to Acend zdołało zgarnąć trzy punkty na start. Jeżeli myśleliście, że na tym skończyła się passa podopiecznych Laurynasa „Nbsa” Kisieliusa, to jesteście w błędzie. Zanim Secret zdążyło odpowiedzieć, to ACE miało już na koncie pięć oczek. Reszta pierwszej połowy zresztą nieznacznie się różniła, gdyż głównie to zespół z dwoma Polakami w składzie punktował. W efekcie starxo i spółka do defensywy przechodzili z ośmioma zwyciężonymi potyczkami.\n\nDruga pistoletówka i drugie zwycięstwo Acend. Tym razem w iście heroicznym stylu, bowiem Santeri „BONECOLD” Sassi zaprezentował prawdziwy pokaz umiejętności, wygrywając sytuację jeden na dwóch. To powoli zwiastowało szybkie zakończenie pierwszej mapy pojedynku. Co prawda Team Secret starał się jeszcze powalczyć, ale ostatecznie przedstawiciele Europy zdołali dopiąć swego i zamknęli mapę 13:8.",
    "PublicationDate": "2021-08-12",
    "PhotoUrl": "https://cybersport.pl/wp-content/uploads/2021/11/VALORANT_Champions_berlin21_mini.jpg",
    "UserId": 2
  },
  {
    "Title": "Jactroll wraca do Vitality! Ale tylko do akademii",
    "Content": "W Teamie Vitality dzień ogłoszeń. W środowy wieczór francuska organizacja zaprezentowała już swój główny skład League of Legends, ale na tym nie koniec. Dziś poznaliśmy też bowiem piątkę, która będzie reprezentować akademię popularnych Pszczół w lidze francuskiej. Jactroll znowu w barwach Vitality\nZ naszej perspektywy największe znaczenie ma bez wątpienia powrót Jakuba „Jactrolla” Skurzyńskiego. 23-letni support w przeszłości bronił już barw Vitality, przez pięć splitów rywalizując w najważniejszych rozgrywkach w Europie. Ba, w 2018 roku on i jego ówcześni koledzy awansowali nawet na mistrzostwa świata. Niemniej po serii słabych występów Polak latem 2020 roku przeniósł się do Origen, a kilka miesięcy później zasilił szeregi Misfits Premier. Tam grał do niedawna, zdobywając w międzyczasie mistrzostwo Francji oraz docierając do półfinału European Masters. Teraz spróbuje powtórzyć te wyczyny, ale już jako reprezentant Vitality.Bee.\n\nPoza Skurzyńskim drużynę zasilili związany do niedawna z Astralis Jesper „Jeskla” Strömberg, a także Andrei „Realistik” Ruse. Ten ostatni w letnim splicie pełnił rolę szkoleniowca głównego zespołu, a teraz odpowiedzialny będzie za wyniki akademii. Akademii, w której swoje miejsce zachowali m.in. Duncan „Skeanz” Marquet oraz Dimitri „Diplex” Ponomarev. Członkiem zespołu nadal będzie także Mathias „Szygenda” Jensen. Przypomnijmy, że Duńczyk rok temu zamienił AGO ROGUE właśnie na Vitality i początkowo występował w pierwszej drużynie, z czasem jednak przesunięto go do akademii. I chociaż w połowie letnich rozgrywek 20-latek znowu wszedł do głównego składu, to nie pomógł mu w zawojowaniu play-offów. W efekcie teraz wraca do Vitality.Bee.",
    "PublicationDate": "2022-08-12",
    "PhotoUrl": "https://cybersport.pl/wp-content/uploads/2020/05/jactroll-lec-2020-spring-w2-730x380.jpg",
    "UserId": 3
  },
  {
    "Title": "Bohaterowie wzmocnieni, przedmioty osłabione. Szczegóły patcha 11.24 w LoL-u",
    "Content": "Minionej nocy na serwerach League of Legends pojawił się patch 11.24. Jest to druga aktualizacja przedsezonowa, która nie tyle wprowadza wielkie nowości, ile ma na celu balans już obecnych w grze rzeczy. I tak zmian doczekało się kilku czempionów, niektóre przedmioty oraz runy, a do tego oba nowe smoki w grze. Łącznie na liście zmodyfikowanych bohaterów znalazło się osiem pozycji, a większość z nich otrzyma tylko wzmocnienia. W przypadku trzech postaci – Kayle, Twitcha oraz Urgota – głównie mowa o dodatkowym bonusie do zasięgu, aczkolwiek usprawnienia pojawiły się też u Caitlyn, Samiry oraz Iverna. Jedyną osłabioną bohaterką w tym patchu jest Camille, której dwie umiejętności będą nieco mniej skuteczne. Zgoła inaczej wygląda to w przypadku itemów oraz run, bowiem tu pojawiło się znacznie więcej nerfów, a wzmocnienia otrzymały tylko jeden przedmiot oraz jedna runa. Są nimi Kostur Archanioła oraz Zdobywca – pierwszy z nich będzie kosztował aż o 400 sztuk złota mniej, natomiast wspomniana runa będzie działać dłużej oraz zagwarantuje więcej mocy w późniejszych etapach. Zaledwie jedna runa znalazła się też na liście nerfów, aczkolwiek tam trafiło aż pięć przedmiotów.",
    "PublicationDate": "2022-11-18",
    "PhotoUrl": "https://cybersport.pl/wp-content/uploads/2021/12/caitlyn-splash-730x380.jpg",
    "UserId": 4
  },
  {
    "Title": "Alphari i Perkz wracają do Europy! Team Vitality ujawnia skład na wiosenny split LEC",
    "Content": "Po długim oczekiwaniu w końcu opublikowane zostało ogłoszenie, na które czekał chyba każdy fan europejskiego League of Legends. Team Vitality nareszcie przerwał milczenie i oficjalnie zaprezentował swój skład na nadchodzący sezon League of Legends European Championship. Tak ekscytującego składu Europa dawno nie widziała. Wracający z Ameryki Luka „Perkz” Perković i Barney „Alphari” Morris wzmocnieni byłą gwiazdą MAD Lions, Matyášem „Carzzym” Orságiem oraz supportem i dżunglerem z poprzedniego splitu tworzą mieszankę wybuchową, której celem może być tylko jedno – zdominowanie Starego Kontynentu. Przed startem sezonu trudno nie stawiać Vitality w roli jednego z największych faworytów do zwycięstwa. Nie dość, że talentu w tej drużynie tyle, że można nim obdarować połowę zawodników z LEC, to jeszcze niemal wszyscy zawodnicy VIT są niezwykle popularnymi i charakterystycznymi osobami. To skład, który albo kochasz, albo nienawidzisz, nie możesz być wobec niego obojętny.",
    "PublicationDate": "2022-11-20",
    "PhotoUrl": "https://cybersport.pl/wp-content/uploads/2021/12/vitality-lec-2022-730x380.jpg",
    "UserId": 1
  }
]