[
  {
    "Title": "OPIS PATCHA 11.24 TEAMFIGHT TACTICS",
    "Content": "Co sądzicie o nowym patchu do LOL-a? Moim zdaniem strasznie znerfili Torbę z przedmiotami.",
    "ThreadDate": "2021-12-12",
    "UserId": 1,
    "GameId": 1,
    "ForumPosts": [
      {
        "Content": "Moim zdaniem nie jest tak źle najgorzej boli mnie nerf Serca Innowatora.",
        "PostDate": "2021-12-13",
        "UserId": 2,
        "ForumThreadId": 1
      },
      {
        "Content": "A tam narzekacie super jest bo wreszcie będzie można kupować inne itemy.",
        "PostDate": "2021-12-14",
        "UserId": 3,
        "ForumThreadId": 1
      }
    ]
  },
  {
    "Title": "Kalendarz adwentowy 2021: Dzień 20 – Object 703 Version II",
    "Content": "Hejka, już drugi rok z rzędu ten sam czołg do wygrania nie denerwuje was to? Ile można dostawać to samo!!",
    "ThreadDate": "2021-12-26",
    "UserId": 2,
    "GameId": 2,
    "ForumPosts": [
      {
        "Content": "Ja dopiero co zacząłem gre więc w sumie nie narzekam przyda się szczególnie, że jest OP.",
        "PostDate": "2021-12-26",
        "UserId": 5,
        "ForumThreadId": 2
      },
      {
        "Content": "No dla ciebie może tak ale ja gram od 8 lat i już widzę ten czołg trzeci raz do zdobycia jak nie więcej.",
        "PostDate": "2021-12-26",
        "UserId": 6,
        "ForumThreadId": 2
      }
    ]
  },
  {
    "Title": "CYKL POŚWIĘCONY KONDYCJI SYSTEMÓW VALORANT – AFK",
    "Content": "Dzisiaj widziałem jak dwóch graczy z mojego team-u AFK-owało na szczęście dzięki nowemu zabezpieczeniu zostali zastąpieni botami, które chociaż trochę ogarniają. Was też już to spotkało?",
    "ThreadDate": "2021-12-17",
    "UserId": 3,
    "GameId": 3,
    "ForumPosts": [
      {
        "Content": "Nie do końca działa bo dosłownie odszedłem od komputera na 20 sekund i mnie wyrzuciło.",
        "PostDate": "2021-12-18",
        "UserId": 7,
        "ForumThreadId": 3
      },
      {
        "Content": "Moim zdaniem działa bardzo dobrze nie powinno się odchodzić zdecydowanie wtedy jak mecz się rozpoczyna.",
        "PostDate": "2021-12-19",
        "UserId": 8,
        "ForumThreadId": 3
      }
    ]
  },
  {
    "Title": "Dreams & Nightmares Contest Winners",
    "Content": "Widzieliście ten turniej? Co sądzicie o zwyciężcach bo szczerze to najbardziej podobała mi się scena z Niranem szkoda, że odpadł.",
    "ThreadDate": "2021-12-24",
    "UserId": 3,
    "GameId": 4,
    "ForumPosts": [
      {
        "Content": "Oglądałem na żywo i muszę powiedzieć, że było na co popatrzeć dużo emocji ale grunt, że mój ulubieniec wygrał!!.",
        "PostDate": "2021-12-25",
        "UserId": 6,
        "ForumThreadId": 4
      },
      {
        "Content": "Na szczęście zwyciężyła nie tylko jedna osoba i mój faworyt też się znalazł w tym gronie.",
        "PostDate": "2021-12-25",
        "UserId": 1,
        "ForumThreadId": 4
      }
    ]
  },
  {
    "Title": "REFLEKSJE O ROZGRYWCE Z 17 GRUDNIA: CO DALEJ?",
    "Content": "Czytaliście już co Riot chce wrzucić do LOL-a w najbliższym czasie? Polecam wam zajrzeć bo to głowa mała.",
    "ThreadDate": "2021-12-24",
    "UserId": 5,
    "GameId": 1,
    "ForumPosts": [
      {
        "Content": "Moim zdaniem powinni coś zrobić z Matchmakingiem bo czekam na głupią rozgrywkę po kilkanaście minut.",
        "PostDate": "2021-12-26",
        "UserId": 2,
        "ForumThreadId": 5
      },
      {
        "Content": "Ja w sumie uważam, że nie mam co narzekać jak dla mnie wszystko działa fajnie czasem długo się oczekuje na zalogowanie.",
        "PostDate": "2021-12-27",
        "UserId": 3,
        "ForumThreadId": 5
      }
    ]
  }
]